; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph5 - mode
	image0 - mode
	thermograph6 - mode
	image7 - mode
	image3 - mode
	image2 - mode
	thermograph4 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation1 - direction
	Star2 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph5)
	(supports instrument0 image7)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star5)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph1)
	(supports instrument2 image2)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument3 image2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph6)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument5 image3)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 image0)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(have_image Phenomenon6 thermograph4)
	(have_image Planet7 thermograph6)
	(have_image Phenomenon8 thermograph4)
	(have_image Phenomenon8 image7)
	(have_image Star9 thermograph4)
	(have_image Planet10 spectrograph1)
	(have_image Planet10 image7)
))

)

; plan
1. (turn_to satellite1 groundstation1 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 planet10 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet10)
   goals met: 0 of 7
5. (turn_to satellite0 star2 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star2)
   goals met: 0 of 7
6. (take_image satellite1 planet10 instrument3 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 1 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
8. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 7
11. (turn_to satellite0 phenomenon6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 7
12. (take_image satellite0 phenomenon6 instrument0 thermograph4)
   added: (have_image phenomenon6 thermograph4)
   goals met: 2 of 7
13. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 7
14. (take_image satellite0 phenomenon8 instrument0 image7)
   added: (have_image phenomenon8 image7)
   goals met: 3 of 7
15. (take_image satellite0 phenomenon8 instrument0 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 4 of 7
16. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 4 of 7
17. (take_image satellite0 planet10 instrument0 image7)
   added: (have_image planet10 image7)
   goals met: 5 of 7
18. (turn_to satellite0 star9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star9)
   goals met: 5 of 7
19. (take_image satellite0 star9 instrument0 thermograph4)
   added: (have_image star9 thermograph4)
   goals met: 6 of 7
20. (turn_to satellite1 star2 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star2)
   goals met: 6 of 7
21. (calibrate satellite1 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 6 of 7
22. (turn_to satellite1 planet7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet7)
   goals met: 6 of 7
23. (take_image satellite1 planet7 instrument4 thermograph6)
   added: (have_image planet7 thermograph6)
   goals met: 7 of 7
